app/controllers/boards_controller.rb

SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`
---
  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page])

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('Miya', 'title', 'body', '2018-05-13 14:13:12', '2018-05-13 14:13:12')
---
  def create
    board = Board.new(board_params)
    if board.save

UPDATE `boards` SET `title` = 'タイトル1', `body` = '本文', `updated_at` = '2018-05-14 14:44:22' WHERE `boards`.`id` = 1
---
  def update
    @board.update(board_params)

DELETE FROM `boards` WHERE `boards`.`id` = 3
---
  def destroy
    @board.destroy

SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 3 LIMIT 1
---
  def set_target_board
    @board = Board.find(params[:id])